# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]


from math import ceil
list = [2, 3, 4, 5, 6]
proiz = []
for i in range(ceil(len(list)/2)):
    proiz.append(list[i]*list[-i-1])


print(proiz)